import React from "react";

function CommonQestion() {
  const dataCommonQ = [
    {
      title: "بعد از عمل لازک چشم چه علایم موقتی پدیدار می شود؟",
      desc: "حساسیت به نور، سوزش مختصرچشم‌ها، اشک ریزش بعد از عمل و ورم پلک‌ها در چند روز اول طبیعی است. از داروها طبق دستور استفاده نمایید. درروز اول بعد از عمل برای کم کردن درد از کمپرس سرد استفاده کنید. به این‌صورت که خرده‌های یخ را داخل نایلون ریخته و در دستمال گذاشته و 5 دقیقه روی چشم بگذارید.",
    },
    {
      title: "بعد از عمل لازک چشم چه علایم موقتی پدیدار می شود؟",
      desc: "حساسیت به نور، سوزش مختصرچشم‌ها، اشک ریزش بعد از عمل و ورم پلک‌ها در چند روز اول طبیعی است. از داروها طبق دستور استفاده نمایید. درروز اول بعد از عمل برای کم کردن درد از کمپرس سرد استفاده کنید. به این‌صورت که خرده‌های یخ را داخل نایلون ریخته و در دستمال گذاشته و 5 دقیقه روی چشم بگذارید.",
    },
    {
      title: "بعد از عمل لازک چشم چه علایم موقتی پدیدار می شود؟",
      desc: "حساسیت به نور، سوزش مختصرچشم‌ها، اشک ریزش بعد از عمل و ورم پلک‌ها در چند روز اول طبیعی است. از داروها طبق دستور استفاده نمایید. درروز اول بعد از عمل برای کم کردن درد از کمپرس سرد استفاده کنید. به این‌صورت که خرده‌های یخ را داخل نایلون ریخته و در دستمال گذاشته و 5 دقیقه روی چشم بگذارید.",
    },
    {
      title: "بعد از عمل لازک چشم چه علایم موقتی پدیدار می شود؟",
      desc: "حساسیت به نور، سوزش مختصرچشم‌ها، اشک ریزش بعد از عمل و ورم پلک‌ها در چند روز اول طبیعی است. از داروها طبق دستور استفاده نمایید. درروز اول بعد از عمل برای کم کردن درد از کمپرس سرد استفاده کنید. به این‌صورت که خرده‌های یخ را داخل نایلون ریخته و در دستمال گذاشته و 5 دقیقه روی چشم بگذارید.",
    },
    {
      title: "بعد از عمل لازک چشم چه علایم موقتی پدیدار می شود؟",
      desc: "حساسیت به نور، سوزش مختصرچشم‌ها، اشک ریزش بعد از عمل و ورم پلک‌ها در چند روز اول طبیعی است. از داروها طبق دستور استفاده نمایید. درروز اول بعد از عمل برای کم کردن درد از کمپرس سرد استفاده کنید. به این‌صورت که خرده‌های یخ را داخل نایلون ریخته و در دستمال گذاشته و 5 دقیقه روی چشم بگذارید.",
    },
    {
      title: "بعد از عمل لازک چشم چه علایم موقتی پدیدار می شود؟",
      desc: "حساسیت به نور، سوزش مختصرچشم‌ها، اشک ریزش بعد از عمل و ورم پلک‌ها در چند روز اول طبیعی است. از داروها طبق دستور استفاده نمایید. درروز اول بعد از عمل برای کم کردن درد از کمپرس سرد استفاده کنید. به این‌صورت که خرده‌های یخ را داخل نایلون ریخته و در دستمال گذاشته و 5 دقیقه روی چشم بگذارید.",
    },
  ];
  return (
    <div
      style={{ direction: "ltr" }}
      className="flex flex-col h-[476px] overflow-auto  max-w-[824px] justify-between gap-[5%]"
    >
      {dataCommonQ.map((item) => {
        return (
          <div className="flex flex-col h-[167px] max-w-[802px] justify-between ">
            <div className="flex text-[#3F1EE3] justify-between h-[24px] mb-6 ">
              <h4>{item.title}</h4>
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M13.26 3.60022L5.05 12.2902C4.74 12.6202 4.44 13.2702 4.38 13.7202L4.01 16.9602C3.88 18.1302 4.72 18.9302 5.88 18.7302L9.1 18.1802C9.55 18.1002 10.18 17.7702 10.49 17.4302L18.7 8.74022C20.12 7.24022 20.76 5.53022 18.55 3.44022C16.35 1.37022 14.68 2.10022 13.26 3.60022Z"
                  stroke="#0D0630"
                  strokeWidth="1.5"
                  stroke-miterlimit="10"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
                <path
                  d="M11.89 5.0498C12.32 7.8098 14.56 9.9198 17.34 10.1998"
                  stroke="#064247"
                  strokeWidth="1.5"
                  stroke-miterlimit="10"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
                <path
                  d="M3 22H21"
                  stroke="#292D32"
                  strokeWidth="1.5"
                  stroke-miterlimit="10"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
              </svg>
            </div>
            <p className="text-[14px] font-light text-[#757575] h-[62px] mr-[1.5%]">
              {item.desc}
            </p>
            <hr className="w-[417px] mr-[2%]" />
          </div>
        );
      })}
    </div>
  );
}

export default CommonQestion;
